# __LEITURA DE ARQUIVO DE DADOS__

---

## O QUE É A BIBLIOTECA PANDAS?

Pandas é um biblioteca para __manipulação e análise de dados__, escrita em Python. <BR> Essa é a biblioteca perfeita para iniciar suas análises exploratórias de dados, pois ela nos permite __ler__, __manipular__, __agregar__ e __plotar__ os dados em poucos passos.
    
[Link do arquivo no Medium onde conto um pouco mais sobre a biblioteca.](https://medium.com/tech-grupozap/introdu%C3%A7%C3%A3o-a-biblioteca-pandas-89fa8ed4fa38)
    
---

## __DATAFRAME__

![](./img/dataframe.png)

Em uma simples definição, DataFrame é como se fosse uma planilha de Excel ou uma tabela de banco de dados. 
<br>É composto por __linhas__, __colunas__,  e __índice__. 
<br>Quando nós lemos algum arquivo de dados, ele se torna um DataFrame para o Pandas.

---

### ALGUNS FORMATOS QUE O PANDA LE DE FORMA NATIVA

[Fonte da tabela](https://pandas.pydata.org/docs/user_guide/io.html)

| Format Type | Data Description    | Reader       | Writer     |
|:-----------:|:-------------------:|:------------:|:----------:|
|text         |CSV                  |read_csv      |to_csv      |
|text         |Fixed-Width Text File|read_fwf      |            |
|text         |JSON                 |read_json     |to_json     |
|text         |HTML                 |read_html     |to_html     |
|text         |Local clipboard      |read_clipboard|to_clipboard|
|binary       |MS Excel             |read_excel    |to_excel    |
|binary       |HDF5 Format          |read_hdf      |to_hdf      |
|binary       |Feather Format       |read_feather  |to_feather  |
|binary       |Parquet Format       |read_parquet  |to_parquet  |
|binary       |ORC Format           |read_orc      |            |
|binary       |Msgpack              |read_msgpack  |to_msgpack  |
|binary       |Stata                |read_stata    |to_stata    |
|binary       |SAS                  |read_sas      |            |
|binary       |SPSS                 |read_spss     |            |
|binary       |Python Pickle Format |read_pickle   |to_pickle   |
|SQL          |SQL|read_sql         |to_sql        |            |
|SQL          |Google BigQuery      |read_gbq      |to_gbq      |

---

## INSTALANDO A BIBLIOTECA PANDAS

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\lmbr4\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: numpy>=1.15.4 in c:\users\lmbr4\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\lmbr4\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\lmbr4\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\lmbr4\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

## IMPORTANDO  A BIBLIOTECA

In [2]:
import pandas as pd

In [3]:
pd

![](./img/pandas_pasta.png)

### LENDO UM CSV
***

      nome  uf  nota
0    Lucas  SP    10
1    Maria  RJ     9
2  Ricardo  RS     8
3      Ana  DF     7
4    Pedro  MG     6

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    6 non-null      object
 1   uf      6 non-null      object
 2   nota    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    6 non-null      category
 1   uf      6 non-null      category
 2   nota    6 non-null      int64
dtypes: category(2), int64(1)
memory usage: 604.0 bytes

### LENDO UM XLSX
***

      nome  uf  nota
0    Lucas  SP    10
1    Maria  RJ     9
2  Ricardo  RS     8
3      Ana  DF     7
4    Pedro  MG     6
5    Carla  RN     5

### LENDO UM JSON
***

      nome  uf  nota
0    Lucas  SP    10
1    Maria  RJ     9
2  Ricardo  RS     8
3      Ana  DF     7
4    Pedro  MG     6
5    Carla  RN     5

---

## __LENDO OS ARQUIVOS DO CASE__

,id_pedido,id_item_pedido,id_produto,id_vendedor,dt_limite_envio,preco,vl_frete
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112650 entries, 0 to 112649
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   id_pedido        112650 non-null  object
 1   id_item_pedido   112650 non-null  int64
 2   id_produto       112650 non-null  object
 3   id_vendedor      112650 non-null  object
 4   dt_limite_envio  112650 non-null  object
 5   preco            112650 non-null  float64
 6   vl_frete         112650 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 6.0+ MB